Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ450/atdf/WBZ450.atdf
        <module name="FREQM" id="U2257" version="1.1.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="2"/>
              <param name="GCLK_ID_REF" value="1"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2409" version="1.0.0">
          <instance name="FUSES">
            <register-group address-space="fuses" name="USER_FUSES" name-in-module="USER_FUSES" offset="0x00045E80"/>
          </instance>
        </module>
        <module name="GPIO" id="02467" version="1.0">
          <instance name="GPIOA">
            <register-group name="GPIOA" name-in-module="GPIO" address-space="base" offset="0x44002200"/>
            <signals>
              <signal group="RA" index="0" function="GPIO" pad="pa0"/>
              <signal group="RA" index="1" function="GPIO" pad="pa1"/>
              <signal group="RA" index="2" function="GPIO" pad="pa2"/>
              <signal group="RA" index="3" function="GPIO" pad="pa3"/>
              <signal group="RA" index="4" function="GPIO" pad="pa4"/>
              <signal group="RA" index="5" function="GPIO" pad="pa5"/>
              <signal group="RA" index="6" function="GPIO" pad="pa6"/>
              <signal group="RA" index="7" function="GPIO" pad="pa7"/>
              <signal group="RA" index="8" function="GPIO" pad="pa8"/>
              <signal group="RA" index="9" function="GPIO" pad="pa9"/>
              <signal group="RA" index="10" function="GPIO" pad="pa10"/>
              <signal group="RA" index="13" function="GPIO" pad="pa13"/>
              <signal group="RA" index="14" function="GPIO" pad="pa14"/>
              <signal group="IOCA" index="0" function="GPIO" pad="pa0"/>
              <signal group="IOCA" index="1" function="GPIO" pad="pa1"/>
              <signal group="IOCA" index="2" function="GPIO" pad="pa2"/>
              <signal group="IOCA" index="3" function="GPIO" pad="pa3"/>
              <signal group="IOCA" index="4" function="GPIO" pad="pa4"/>
              <signal group="IOCA" index="5" function="GPIO" pad="pa5"/>
              <signal group="IOCA" index="6" function="GPIO" pad="pa6"/>
              <signal group="IOCA" index="7" function="GPIO" pad="pa7"/>
              <signal group="IOCA" index="8" function="GPIO" pad="pa8"/>
              <signal group="IOCA" index="9" function="GPIO" pad="pa9"/>
              <signal group="IOCA" index="10" function="GPIO" pad="pa10"/>
              <signal group="IOCA" index="13" function="GPIO" pad="pa13"/>
              <signal group="IOCA" index="14" function="GPIO" pad="pa14"/>
            </signals>
          </instance>
          <instance name="GPIOB">
            <register-group name="GPIOB" name-in-module="GPIO" address-space="base" offset="0x44002300"/>
            <signals>
              <signal group="RB" index="0" function="GPIO" pad="pb0"/>
              <signal group="RB" index="1" function="GPIO" pad="pb1"/>
              <signal group="RB" index="2" function="GPIO" pad="pb2"/>
              <signal group="RB" index="3" function="GPIO" pad="pb3"/>
              <signal group="RB" index="4" function="GPIO" pad="pb4"/>
              <signal group="RB" index="5" function="GPIO" pad="pb5"/>
              <signal group="RB" index="6" function="GPIO" pad="pb6"/>
              <signal group="RB" index="7" function="GPIO" pad="pb7"/>
              <signal group="RB" index="8" function="GPIO" pad="pb8"/>
              <signal group="RB" index="9" function="GPIO" pad="pb9"/>
              <signal group="RB" index="10" function="GPIO" pad="pb10"/>
              <signal group="RB" index="11" function="GPIO" pad="pb11"/>
              <signal group="RB" index="12" function="GPIO" pad="pb12"/>
              <signal group="RB" index="13" function="GPIO" pad="pb13"/>
              <signal group="IOCB" index="0" function="GPIO" pad="pb0"/>
              <signal group="IOCB" index="1" function="GPIO" pad="pb1"/>
              <signal group="IOCB" index="2" function="GPIO" pad="pb2"/>
              <signal group="IOCB" index="3" function="GPIO" pad="pb3"/>
              <signal group="IOCB" index="4" function="GPIO" pad="pb4"/>
              <signal group="IOCB" index="5" function="GPIO" pad="pb5"/>
              <signal group="IOCB" index="6" function="GPIO" pad="pb6"/>
              <signal group="IOCB" index="7" function="GPIO" pad="pb7"/>
              <signal group="IOCB" index="8" function="GPIO" pad="pb8"/>
              <signal group="IOCB" index="9" function="GPIO" pad="pb9"/>
              <signal group="IOCB" index="10" function="GPIO" pad="pb10"/>
              <signal group="IOCB" index="11" function="GPIO" pad="pb11"/>
              <signal group="IOCB" index="12" function="GPIO" pad="pb12"/>
              <signal group="IOCB" index="13" function="GPIO" pad="pb13"/>
            </signals>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="2.1.4">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x42002400"/>
            <parameters>
              <param name="MASTER_NUM" value="8"/>
              <param name="MASTER_CM4_S" value="0"/>
              <param name="MASTER_CMCC" value="1"/>
              <param name="MASTER_PICOP_MEM" value="2"/>
              <param name="MASTER_PICOP_IO" value="3"/>
              <param name="MASTER_DMAC_DTWR" value="4"/>
              <param name="MASTER_DMAC_DTRD" value="5"/>
              <param name="MASTER_ICM" value="6"/>
              <param name="MASTER_DSU" value="7"/>
              <param name="SLAVE_NUM" value="14"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_FLASH_ALT" value="1"/>
              <param name="SLAVE_SEEPROM" value="2"/>
              <param name="SLAVE_RAMCM4S" value="3"/>
              <param name="SLAVE_RAMPPPDSU" value="4"/>
              <param name="SLAVE_RAMDMAWR" value="5"/>
              <param name="SLAVE_RAMDMACICM" value="6"/>
              <param name="SLAVE_HPB0" value="7"/>
              <param name="SLAVE_HPB1" value="8"/>
              <param name="SLAVE_HPB2" value="9"/>
              <param name="SLAVE_HPB3" value="10"/>
              <param name="SLAVE_SDHC0" value="12"/>
              <param name="SLAVE_QSPI" value="14"/>
              <param name="SLAVE_BKUPRAM" value="15"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="U2010" version="1.2.0">
          <instance name="ICM">
            <register-group name="ICM" name-in-module="ICM" address-space="base" offset="0x42002C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.2.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="4"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
