Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ450/atdf/WBZ450.atdf
        <register caption="" name="SLEWCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x164"> </register>
        <register caption="" name="SLEWCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x168"> </register>
        <register caption="" name="SLEWCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x16C"> </register>
        <register caption="CLOCK STATUS REGISTER" initval="0x0" name="CLKSTAT" offset="0x170" rw="RW" size="4">
          <bitfield caption="FRC Ready Status value" mask="0x00000001" name="FRCRDY" values="CLKSTAT__FRCRDY"/>
          <bitfield caption="System PLL1 Ready Status value" mask="0x00000002" name="SPLL1RDY" values="CLKSTAT__SPLL1RDY"/>
          <bitfield caption="Primary Oscillator Ready Status value" mask="0x00000004" name="POSCRDY" values="CLKSTAT__POSCRDY"/>
          <bitfield caption="SOSC Ready Status value" mask="0x00000008" name="SOSCRDY" values="CLKSTAT__SOSCRDY"/>
          <bitfield caption="LPRC Ready Status value" mask="0x00000020" name="LPRCRDY" values="CLKSTAT__LPRCRDY"/>
          <bitfield caption="System PLL3 Ready Status value" mask="0x00000200" name="SPLL3RDY" values="CLKSTAT__SPLL3RDY"/>
        </register>
        <register caption="USER CLK DIAGNOSTICS CONTROL REGISTER" initval="0x0" name="CLKDIAG" offset="0x190" rw="RW" size="4">
          <bitfield caption="POSC Clock Stop Control value" mask="0x00000001" name="POSCSTOP" values="CLKDIAG__POSCSTOP"/>
          <bitfield caption="SOSC Clock Stop Control value" mask="0x00000002" name="SOSCSTOP" values="CLKDIAG__SOSCSTOP"/>
          <bitfield caption="FRC Clock Stop Control value" mask="0x00000004" name="FRCSTOP" values="CLKDIAG__FRCSTOP"/>
          <bitfield caption="LPRC Clock Stop Control value" mask="0x00000008" name="LPRCSTOP" values="CLKDIAG__LPRCSTOP"/>
          <bitfield caption="SPLL1 Clock Stop Control value" mask="0x00000010" name="SPLL1STOP" values="CLKDIAG__SPLL1STOP"/>
          <bitfield caption="SPLL2 Clock Stop Control value" mask="0x00000020" name="SPLL2STOP" values="CLKDIAG__SPLL2STOP"/>
          <bitfield caption="SPLL3 Clock Stop Control value" mask="0x00000040" name="SPLL3STOP" values="CLKDIAG__SPLL3STOP"/>
          <bitfield caption="NMI Counter value" mask="0xFFFF0000" name="NMICNT"/>
        </register>
      </register-group>
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
        <value caption="Request oscillator switch to selection specified by NOSC[3:0] bits" name="SWITCH" value="0x1"/>
        <value caption="Oscillator switch is complete" name="SWITCH_COMPLETE" value="0x0"/>
      </value-group>
      <value-group caption="32 kHz Secondary (LP) Oscillator Enable bit" name="OSCCON__SOSCEN">
        <value caption="Enable Secondary Oscillator" name="ON" value="0x1"/>
        <value caption="Disable Secondary Oscillator" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit (Read / writable / Clearable by application)" name="OSCCON__CF">
        <value caption="FSCM has detected clock failure" name="FAIL_DET" value="0x1"/>
        <value caption="FSCM has not detected clock failure" name="NO_FAILDET" value="0x0"/>
      </value-group>
      <value-group caption="Enable SLEEP Mode bit" name="OSCCON__SLPEN">
        <value caption="When a WAIT Instruction is executed device will enter SLEEP Mode" name="SLEEP" value="0x1"/>
        <value caption="When a WAIT instruction is executed device will enter IDLE Mode" name="IDLE" value="0x0"/>
      </value-group>
      <value-group caption="Clock Lock Enabled bit" name="OSCCON__CLKLOCK">
        <value caption="All clock and PLL configuration registers are locked.  These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV" name="LOCKED" value="0x1"/>
        <value caption="Clock and PLL selection registers are not locked, configurations may be modified" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
        <value caption="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1)" name="FRCDIV" value="0x0"/>
        <value caption="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" name="SPLL" value="0x1"/>
        <value caption="Primary Oscillator" name="POSC" value="0x2"/>
        <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x3"/>
        <value caption="Low Power RC Oscillator (LPRC)" name="LPRC" value="0x4"/>
      </value-group>
      <value-group caption="Current Oscillator Selection bits (Read-only)" name="OSCCON__COSC">
        <value caption="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1)" name="FRCDIV" value="0x0"/>
        <value caption="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" name="SPLL" value="0x1"/>
        <value caption="Primary Oscillator- POSC" name="POSC" value="0x2"/>
        <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x3"/>
        <value caption="Low Power RC Oscillator (LPRC)" name="LPRC" value="0x4"/>
      </value-group>
      <value-group caption="" name="OSCCON__WAKE2SPD">
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready" name="FRC" value="0x1"/>
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from the selected clock." name="SELECTED_CLK" value="0x0"/>
      </value-group>
      <value-group caption="Enable Dream Mode bit" name="OSCCON__DRMEN">
        <value caption="When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered" name="SLEEP" value="0x1"/>
        <value caption="DMA transfer has no effect" name="NO_EFFECT" value="0x0"/>
      </value-group>
      <value-group caption="Fast RC Clock Divider bits" name="OSCCON__FRCDIV">
        <value caption="FRC Divide by 1" name="DIV_1" value="0x0"/>
        <value caption="FRC Divide by 2" name="DIV_2" value="0x1"/>
        <value caption="FRC Divide by 4" name="DIV_4" value="0x2"/>
        <value caption="FRC Divide by 8" name="DIV_8" value="0x3"/>
        <value caption="FRC Divide by 16" name="DIV_16" value="0x4"/>
        <value caption="FRC Divide by 32" name="DIV_32" value="0x5"/>
        <value caption="FRC Divide by 64" name="DIV_64" value="0x6"/>
        <value caption="FRC Divide by 256" name="DIV_256" value="0x7"/>
      </value-group>
      <value-group caption="Internal Fast RC (FRC) Oscillator Tuning bits" name="OSCTUN__TUN">
        <value caption="Maximum Frequency" name="Max" value="0x1f"/>
        <value caption="Center Frequency, oscillator is running at calibrated frequency" name="Center" value="0x0"/>
        <value caption="Minimum Frequency" name="Min" value="0x20"/>
      </value-group>
      <value-group caption="PLL Power Down Register bit" name="SPLLCON__SPLLPWDN">
        <value caption="PLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="PLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Force Lock" name="SPLLCON__SPLLFLOCK">
        <value caption="Force the SPLL lock signal to be asserted" name="ASSERT" value="0x1"/>
        <value caption="Do not force the SPLL lock signal to be asserted" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Reset" name="SPLLCON__SPLLRST">
        <value caption="Assert the reset to the SPLL" name="ASSERT" value="0x1"/>
        <value caption="De-assert the reset to the SPLL" name="NO_ASSERT" value="0x0"/>
      </value-group>
