Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ450/atdf/WBZ450.atdf
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x4"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x8"/>
          <bitfield name="RAMECC_" caption="RAMECC APB Protect Enable" mask="0x10"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="QSPI_" caption="QSPI APB Protect Enable" mask="0x1"/>
          <bitfield name="AES_" caption="AES APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x10"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x40"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x80"/>
          <bitfield name="TRNG_" caption="TRNG APB Protect Enable" mask="0x400"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PCHE" id="920" version="1.0" caption="this is the PCHE">
      <register-group name="PCHE" caption="this is the PCHE">
        <register name="CHECON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0700010F" caption="">
          <bitfield name="PFMWS" caption="" mask="0xf"/>
          <bitfield name="PREFEN" caption="" mask="0x30"/>
          <bitfield name="PFMSECEN" caption="" mask="0x80"/>
          <bitfield name="ADRWS" caption="" mask="0x100"/>
          <bitfield name="CHEPERF" caption="" mask="0x1000"/>
          <bitfield name="ICHECOH" caption="" mask="0x10000"/>
          <bitfield name="DCHECOH" caption="" mask="0x20000"/>
          <bitfield name="ACHECOH" caption="" mask="0x40000"/>
          <bitfield name="ICHEINV" caption="" mask="0x100000"/>
          <bitfield name="DCHEINV" caption="" mask="0x200000"/>
          <bitfield name="ACHEINV" caption="" mask="0x400000"/>
          <bitfield name="ICHEEN" caption="" mask="0x1000000"/>
          <bitfield name="DCHEEN" caption="" mask="0x2000000"/>
          <bitfield name="ACHEEN" caption="" mask="0x4000000"/>
        </register>
        <register name="CHESTAT" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PFMSECCNT" caption="" mask="0xff"/>
          <bitfield name="PFMSEC" caption="" mask="0x4000000"/>
          <bitfield name="PFMDED" caption="" mask="0x8000000"/>
        </register>
        <register name="CHEHIT" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CHEHIT" caption="" mask="0xffffffff"/>
        </register>
        <register name="CHEMIS" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CHEMIS" caption="" mask="0xffffffff"/>
        </register>
      </register-group>
    </module>
    <module name="PFW" id="910" version="1.0" caption="flash wrapper">
      <register-group name="PFW" caption="flash wrapper">
        <register name="IFT_CON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FRZ" caption="" mask="0x2000"/>
          <bitfield name="SIDL" caption="" mask="0x4000"/>
          <bitfield name="ON" caption="" mask="0x8000"/>
        </register>
        <register name="IFT_CRCCON" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="AUTOR" caption="" mask="0x1"/>
          <bitfield name="RBITO" caption="" mask="0x2"/>
          <bitfield name="PAUSE" caption="" mask="0x4"/>
          <bitfield name="PLEN32" caption="" mask="0x1000"/>
          <bitfield name="ERROR" caption="" mask="0x2000"/>
          <bitfield name="DONE" caption="" mask="0x4000"/>
          <bitfield name="CRCEN" caption="" mask="0x8000"/>
          <bitfield name="PERIOD" caption="" mask="0xffff0000"/>
        </register>
        <register name="IFT_CRCMADR" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="IFT_CRCMADR" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCMLEN" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCMLEN" caption="" mask="0xffffff"/>
        </register>
        <register name="IFT_CRCIV" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCIV" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCACC" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCACC" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCPOLY" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CYCPOLY" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCFXOR" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCFXOR" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCSUM" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCSUM" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_ECCCON" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FLT_MD" caption="" mask="0x7"/>
          <bitfield name="EVENT" caption="" mask="0x80"/>
          <bitfield name="CTLFLT" caption="" mask="0x700"/>
          <bitfield name="FLTEN" caption="" mask="0x8000"/>
        </register>
