Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ450/atdf/WBZ450.atdf
      <value-group name="SCOM3P0_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM3P1_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM3P2_PINS" caption="Group3">
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM3P3_PINS" caption="Group4">
        <value name="RPA6" caption="RPA6" value="1"/>
        <value name="RPA10" caption="RPA10" value="2"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA5" caption="RPA5" value="8"/>
        <value name="RPA9" caption="RPA9" value="9"/>
        <value name="RPB6" caption="RPB6" value="12"/>
        <value name="RPA8" caption="RPA8" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QSCK_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD0_PINS" caption="Group4">
        <value name="RPA6" caption="RPA6" value="1"/>
        <value name="RPA10" caption="RPA10" value="2"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA5" caption="RPA5" value="8"/>
        <value name="RPA9" caption="RPA9" value="9"/>
        <value name="RPB6" caption="RPB6" value="12"/>
        <value name="RPA8" caption="RPA8" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD1_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD2_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD3_PINS" caption="Group3">
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="REFI_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="CCLIN0_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="CCLIN1_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="CCLIN2_PINS" caption="Group3">
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="CCLIN3_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="CCLIN4_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="CCLIN5_PINS" caption="Group3">
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
