Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ450/atdf/WBZ450.atdf
      <value-group name="RPB6G3_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="1"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="2"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="3"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="4"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="5"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="6"/>
        <value name="TCC0WO2" caption="TCC0/WO2" value="11"/>
        <value name="TCC0WO0" caption="TCC0/WO0" value="12"/>
        <value name="TCC0WO4" caption="TCC0/WO4" value="13"/>
        <value name="TCC1WO2" caption="TCC1/WO2" value="14"/>
        <value name="TCC1WO0" caption="TCC1/WO0" value="15"/>
        <value name="TCC1WO4" caption="TCC1/WO4" value="16"/>
        <value name="TCC2WO0" caption="TCC2/WO0" value="17"/>
        <value name="TC0WO0" caption="TC0/WO0" value="18"/>
        <value name="REFO3" caption="REFO3" value="19"/>
        <value name="TC1WO0" caption="TC1/WO0" value="20"/>
        <value name="TC2WO0" caption="TC2/WO0" value="21"/>
        <value name="TC3WO0" caption="TC3/WO0" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD1" caption="QD1" value="25"/>
        <value name="QD0" caption="QD0" value="26"/>
        <value name="QD3" caption="QD3" value="27"/>
        <value name="CCLOUT0" caption="CCLOUT0" value="28"/>
        <value name="TSTBUS2" caption="TSTBUS2" value="29"/>
        <value name="TSTBUS6" caption="TSTBUS6" value="30"/>
        <value name="TSTBUS10" caption="TSTBUS10" value="31"/>
      </value-group>
      <value-group name="RPB6G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="1"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="2"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="3"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="4"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="5"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="6"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="11"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="12"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="13"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="14"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="15"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="16"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="17"/>
        <value name="TC0WO0" caption="TC0/WO0" value="18"/>
        <value name="REFO4" caption="REFO4" value="19"/>
        <value name="TC1WO1" caption="TC1/WO1" value="20"/>
        <value name="TC2WO1" caption="TC2/WO1" value="21"/>
        <value name="TC3WO1" caption="TC3/WO1" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD2" caption="QD2" value="25"/>
        <value name="QD1" caption="QD1" value="26"/>
        <value name="QD0" caption="QD0" value="27"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="28"/>
        <value name="TSTBUS3" caption="TSTBUS3" value="29"/>
        <value name="TSTBUS7" caption="TSTBUS7" value="30"/>
        <value name="TSTBUS11" caption="TSTBUS11" value="31"/>
      </value-group>
      <value-group name="RPB7G1_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="1"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="2"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="3"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="4"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="5"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="6"/>
        <value name="TCC0WO0" caption="TCC0/WO0" value="11"/>
        <value name="TCC0WO4" caption="TCC0/WO4" value="12"/>
        <value name="TCC0WO2" caption="TCC0/WO2" value="13"/>
        <value name="TCC1WO0" caption="TCC1/WO0" value="14"/>
        <value name="TCC1WO4" caption="TCC1/WO4" value="15"/>
        <value name="TCC1WO2" caption="TCC1/WO2" value="16"/>
        <value name="TCC2WO0" caption="TCC2/WO0" value="17"/>
        <value name="TC0WO1" caption="TC0/WO1" value="18"/>
        <value name="REFO1" caption="REFO1" value="19"/>
        <value name="TC1WO0" caption="TC1/WO0" value="20"/>
        <value name="TC2WO0" caption="TC2/WO0" value="21"/>
        <value name="TC3WO0" caption="TC3/WO0" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD3" caption="QD3" value="25"/>
        <value name="QD2" caption="QD2" value="26"/>
        <value name="QD1" caption="QD1" value="27"/>
        <value name="CCLOUT0" caption="CCLOUT0" value="28"/>
        <value name="TSTBUS0" caption="TSTBUS0" value="29"/>
        <value name="TSTBUS4" caption="TSTBUS4" value="30"/>
        <value name="TSTBUS8" caption="TSTBUS8" value="31"/>
      </value-group>
      <value-group name="RPB7G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="1"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="2"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="3"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="4"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="5"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="6"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="11"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="12"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="13"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="14"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="15"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="16"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="17"/>
        <value name="TC0WO0" caption="TC0/WO0" value="18"/>
        <value name="REFO4" caption="REFO4" value="19"/>
        <value name="TC1WO1" caption="TC1/WO1" value="20"/>
        <value name="TC2WO1" caption="TC2/WO1" value="21"/>
        <value name="TC3WO1" caption="TC3/WO1" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD2" caption="QD2" value="25"/>
        <value name="QD1" caption="QD1" value="26"/>
        <value name="QD0" caption="QD0" value="27"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="28"/>
        <value name="TSTBUS3" caption="TSTBUS3" value="29"/>
        <value name="TSTBUS7" caption="TSTBUS7" value="30"/>
        <value name="TSTBUS11" caption="TSTBUS11" value="31"/>
      </value-group>
      <value-group name="RPB8G1_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="1"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="2"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="3"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="4"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="5"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="6"/>
        <value name="TCC0WO0" caption="TCC0/WO0" value="11"/>
        <value name="TCC0WO4" caption="TCC0/WO4" value="12"/>
        <value name="TCC0WO2" caption="TCC0/WO2" value="13"/>
        <value name="TCC1WO0" caption="TCC1/WO0" value="14"/>
        <value name="TCC1WO4" caption="TCC1/WO4" value="15"/>
        <value name="TCC1WO2" caption="TCC1/WO2" value="16"/>
        <value name="TCC2WO0" caption="TCC2/WO0" value="17"/>
        <value name="TC0WO1" caption="TC0/WO1" value="18"/>
        <value name="REFO1" caption="REFO1" value="19"/>
        <value name="TC1WO0" caption="TC1/WO0" value="20"/>
        <value name="TC2WO0" caption="TC2/WO0" value="21"/>
        <value name="TC3WO0" caption="TC3/WO0" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD3" caption="QD3" value="25"/>
        <value name="QD2" caption="QD2" value="26"/>
        <value name="QD1" caption="QD1" value="27"/>
        <value name="CCLOUT0" caption="CCLOUT0" value="28"/>
        <value name="TSTBUS0" caption="TSTBUS0" value="29"/>
        <value name="TSTBUS4" caption="TSTBUS4" value="30"/>
        <value name="TSTBUS8" caption="TSTBUS8" value="31"/>
      </value-group>
